Revit 2027 API
BuiltInFailures.ViewFailures.CannotPasteViewReferences Property
 Cannot paste view references into the view they reference or into unrelated views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPasteViewReferences { get; }
Public Shared ReadOnly Property CannotPasteViewReferences As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPasteViewReferences {
	FailureDefinitionId^ get ();
}
static member CannotPasteViewReferences : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace